In [4]:
import pandas as pd
import os
os.chdir('D:\\Users\Dell\Desktop\Data Science\Datasets')

In [5]:
df = pd.read_csv("salaries.csv")
df

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [6]:
inp = df.drop('salary_more_then_100k',1)
inp

C:\Users\Dell\AppData\Local\Temp/ipykernel_29540/2389450942.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  inp = df.drop('salary_more_then_100k',1)

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [7]:
target = df['salary_more_then_100k']
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [8]:
from sklearn.preprocessing import LabelEncoder

In [9]:
le_comp = LabelEncoder()
le_job = LabelEncoder()
le_deg = LabelEncoder()

In [10]:
inp['comp_n']=le_comp.fit_transform(inp['company'])
inp['job_n']=le_job.fit_transform(inp['job'])
inp['deg_n']=le_deg.fit_transform(inp['degree'])

In [11]:
inp.head()

  company                  job     degree  comp_n  job_n  deg_n
0  google      sales executive  bachelors       2      2      0
1  google      sales executive    masters       2      2      1
2  google     business manager  bachelors       2      0      0
3  google     business manager    masters       2      0      1
4  google  computer programmer  bachelors       2      1      0

In [12]:
inp_n=inp.drop(['company','job','degree'],1)
inp_n.head()

C:\Users\Dell\AppData\Local\Temp/ipykernel_29540/3230177057.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  inp_n=inp.drop(['company','job','degree'],1)

   comp_n  job_n  deg_n
0       2      2      0
1       2      2      1
2       2      0      0
3       2      0      1
4       2      1      0

In [13]:
from sklearn import tree

In [14]:
model = tree.DecisionTreeClassifier()
model.fit(inp_n,target)

DecisionTreeClassifier()

In [15]:
model.score(inp_n,target)

1.0

In [16]:
model.predict([[2,2,1]])

array([0], dtype=int64)

In [17]:
model.predict([[2,0,1]])

array([1], dtype=int64)